# Required for Bundle installations
# ref: https://github.com/Homebrew/homebrew-bundle
tap "homebrew/bundle"

# Ubuntu like suggestions for unknown commands
# ref: https://github.com/Homebrew/homebrew-command-not-found
tap "homebrew/command-not-found"

# Formulae
brew "bat"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "git"
brew "git-delta"
brew "go"
brew "lazygit"
brew "luarocks"
brew "neowim"
brew "oh-my-posh"
brew "ripgrep"
brew "rustup"
brew "stow"
brew "tmux"
brew "yazi"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"

# Bun
# ref: https://github.com/oven-sh/bun
tap "oven-sh/bun"
brew "oven-sh/bun/bun"

# Fonts
cask "font-fira-code-nerd-font"

# Casks
cask "1password"
cask "adguard"
cask "cleanmymac"
cask "cleanshot"
cask "deepl"
cask "docker"
cask "ghostty"
cask "macs-fan-control"
cask "microsoft-teams"
cask "pixelsnap"
cask "proton-mail"
cask "protonvpn"
cask "spotify"
cask "telegram"
cask "zen-browser"
