# Ubuntu like suggestions for unknown commands
# ref: https://github.com/Homebrew/homebrew-command-not-found
tap "homebrew/command-not-found"

# Formulae
brew "awscli"
brew "bat"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "git"
brew "git-delta"
brew "go"
brew "imagemagick"
brew "lazygit"
brew "luarocks"
brew "neovim"
brew "oh-my-posh"
brew "ripgrep"
brew "stow"
brew "tectonic"
brew "tmux"
brew "tree-sitter-cli"
brew "yazi"
brew "zoxide"
brew "zsh"

# Fonts
cask "font-fira-code-nerd-font"

# Casks
cask "1password"
cask "adguard"
cask "cleanmymac"
cask "cleanshot"
cask "deepl"
cask "docker"
cask "figma"
cask "ghostty"
cask "karabiner-elements"
cask "microsoft-teams"
cask "pixelsnap"
cask "proton-drive"
cask "proton-mail"
cask "protonvpn"
cask "spotify"
cask "telegram"
cask "zen-browser"

# App store
brew "mas"
mas "1Password for Safari", id: 1569813296
mas "Magnet", id: 441258766
mas "WireGuard", id: 1451685025
